/********************************************************************************************
函数名称：	DS18B20.c
描述	：	DS18B20驱动程序
输入	：	无
输出	：	无
返回	：	无
注意事项：	无
*********************************************************************************************/
#include "STC.h"
#include "DS18B20.h"

uint tvalue;		//温度值
uchar tflag;


/*DS18B20驱动程序------------------------------------------------------------*/
/********************************************************************************************
名称：延时程序
功能：延时1us
*********************************************************************************************/		 
void DelayDS18B20(unsigned int i)
{
 	while(i--);
}

/********************************************************************************************
名称：DS18B20驱动程序
功能：驱动DS18B20温度传感器
*********************************************************************************************/		 
void Init_DS18B20()		//DS18B20复位
{  
 	unsigned char x=0;
	DQ = 1;          //DQ复位
	DelayDS18B20(4);  //延时
	DQ = 0;          //DQ拉低
	DelayDS18B20(100);//精确延时大于480us
	DQ = 1;          //拉高
	DelayDS18B20(40);	 
}  
  
uchar DS18B20ReadData()/*读数据*/
{ 
  	unsigned char i=0;
    unsigned char dat = 0;
	for (i=8;i>0;i--)
	{   
	   	DQ = 0; //给脉冲信号
		dat>>=1;
		DQ = 1; //给脉冲信号
		if(DQ)
		  dat|=0x80;
		  DelayDS18B20(10);
	}
 	return(dat);
}

void DS18B20WrData(uchar Data)/*写数据*/
{
  	unsigned char i=0;
    for (i=8; i>0; i--)
   	{ 
		DQ = 0;
     	DQ = Data&0x01;
     	DelayDS18B20(10);
     	DQ = 1;
     	Data>>=1;
   }
}
uint Read_Temp()/*读取温度值并转换*/
{
	uchar a,b;
	float m;
	Init_DS18B20();    
	DS18B20WrData(0xcc);//*跳过读序列号*/
	DS18B20WrData(0x44);//*启动温度转换*/
	Init_DS18B20();    
	DS18B20WrData(0xcc);//*跳过读序列号*/ 
	DS18B20WrData(0xbe);//*读取温度*/ 
	a = DS18B20ReadData();
	b = DS18B20ReadData();
	tvalue = b;
	tvalue <<= 8;
	tvalue=tvalue|a;
	if(tvalue<0x0fff)
   		tflag=0;
	else
	{
		tvalue=~tvalue+1;
	 	tflag=1;
	}
	m=tvalue*(0.0625);//tvalue <<= 8;温度值扩大10倍，精确到1位小数
	tvalue=m*10+0.5;
	return(tvalue);
}


/*---------------------------------------------------------------------------*/
