/********************************************************************************************
名称：DS18B20.c
功能：DS18B20驱动程序
作者：
时间：
*********************************************************************************************/		   
#include "STC_NEW_8051.h"
#include "DS18B20.h"

/*DS18B20驱动程序------------------------------------------------------------*/
uchar data disdata[5];
uint tvalue;//温度值

/*延时1微秒------------------------------------------------------------------*/

void delay_18B20(uint i) { while(i--);;; } 	//如果使用STC12C5A60S单片机需要修改延时函数

/*********************************************************************** 
// 函数功能：ds18B20复位 
// 入口参数：无 
// 出口参数：unsigned char x： 0：成功 1：失败 
//**********************************************************************/ 
void ds1820rst()
{  
	uchar x=0;
	DQ=1;              //DQ复位
	delay_18B20(8);    //延时
	DQ=0;              //DQ拉低
	delay_18B20(250);   //精确延时大于480us
	delay_18B20(250);   //精确延时大于480us
	DQ=1;              //拉高
	delay_18B20(140);
	x=DQ;              //稍做延时后 如果x=0则初始化成功 x=1则初始化失败
	while(!DQ);
	delay_18B20(20);
}
/*读一个字节-----------------------------------------------------------------*/  
uchar ds1820rd()
{ 
	uchar i=0;
	uchar dat=0;
	for (i=8;i>0;i--)
	{   
		DQ=0;     //给脉冲信号
		dat>>=1;
		DQ=1;     //给脉冲信号
		if(DQ)
			dat|=0x80;
			delay_18B20(14);
	}
	return(dat);
}
/*写一个字节-----------------------------------------------------------------*/
void ds1820wr(uchar wdata)
{
	uchar i=0;
   for (i=8;i>0;i--)
	{ 
		DQ=0;
		DQ=wdata&0x01;
		delay_18B20(15);
		DQ=1;
		wdata>>=1;
	}
}
/*读取温度值并转换-----------------------------------------------------------*/  
read_temp()
{
	uchar a,b;
   	ds1820rst();    
   	ds1820wr(0xcc);//*跳过读序列号*/
   	ds1820wr(0x44);//*启动温度转换*/
		delay_18B20(100);
   	ds1820rst();    
   	ds1820wr(0xcc);//*跳过读序列号*/ 
   	ds1820wr(0xbe);//*读取温度*/ 
		delay_18B20(100);
   	a=ds1820rd();
   	b=ds1820rd();
   	tvalue=b;
   	tvalue<<=8;
   	tvalue=tvalue|a;
   	tvalue=tvalue*(0.625);//温度值扩大10倍，精确到1位小数
	return(tvalue);
}
/*温度值显示-----------------------------------------------------------------*/
void ds1820disp()
{ 	read_temp();							 //读取温度值
	disdata[0]=tvalue%1000/100+0x30;         //十位数
	disdata[1]=tvalue%100/10+0x30;           //个位数
	disdata[2]=tvalue%10+0x30;               //小数位    
	if(disdata[0]==0x30) { disdata[0]=0x20; }//如果十位为0，不显示
	set1616pic(5,4,0,2);					 //显示"温度计图标"
	write_com(0x30); write_com(0x06);	
	write_com(0x9d);           //在液晶上显示温度起始位置："28.8°C"
	write_data(disdata[0]);    //显示十位 	
	write_data(disdata[1]);    //显示个位 	
	write_data(0x2e);          //显示小数点 	
	write_data(disdata[2]);    //显示小数位
	set1616pic(8,4,0,0);	   //在第6列第1行不反白的°C图标
}
/*---------------------------------------------------------------------------*/
