/******************************************************************************      
* 【名    称】： LCD12864多功能万年历 
* 【语    言】： C语言
* 【编译环境】： Keli3 
* 【晶    振】:  12MHz外部晶振		
* 【芯    片】:  STC89C516RD+
* 【时钟芯片】:  DS1302
* 【温度传感】:  DS18B20 
* 【液 晶 屏】：LCM-12864-ST7920, LCM12864使用并口连接方式,PSB、RST接高电平 		  
* 【程序功能】：显示阳历、农历、时间、温度、按键和红外(HS0038)调整、5组闹钟设置、
*		  		节日生日节气提醒、时间校对 
* 【日    期】:  2013-06-13
* 【作    者】:  Mike	
******************************************************************************/	 
#include "Main.h"

/*------------------------------主函数---------------------------------------*/
void main()
{	                     
	main_init();			//主程序初始化
	ds1302_init();			//时钟芯片初始化
	lcm_init();				//液晶初始化
	read_nz_data();			//读取闹钟数据

	welcome1();				//显示Kiss
	delayms(250);
	lcm_clr2();				//清屏
	Clean_12864_GDRAM();	//清屏

	welcome2();				//显示信息
	delayms(250);
	lcm_clr2();				//清屏
	Clean_12864_GDRAM();	//清屏

	buzzer=0;				//开蜂鸣器
	delayms(30);
	buzzer=1; 				//关蜂鸣器
	keydone();
	
}

/**********************************************************
主程序初始化
**********************************************************/
void main_init(void)
{	
	LCM_PSB=1;	//液晶并口通信
	LCM_BACKLIGHT=0; //打开背光灯

	key1 = 1;  //A
	key2 = 1;  //B
	key3 = 1;  //C
	key4 = 1;  //D
	key5 = 1;  //背光

	EA=1;
	TMOD=0x11;
	IE = 0x81;    //允许总中断中断,使能 INT0 外部中断
    TCON = 0x01;  //触发方式为脉冲负边沿触发   
    IRIN=1;       //IO口初始化
	ET0=1;
	TH0=0x3c;
	TL0=0xb0;
	TR0=0;    
} 
/**********************************************************
定时中断0用于倒数10秒自动退出菜单
**********************************************************/
void chk_main(void) interrupt 1
{
	TH0=0x3c;
	TL0=0xb0;
	zdjs++;
	if(zdjs==20)
	{
		zdjs=0;
		cdds--;//用于倒数10秒自动退出菜单
		if(cdds==255)
		{
			cdds_flag=1;
			cdds=' '; 
		}
	}  
}

/*结束----------------------------------------------------------------------*/